bench.yaml
config:
  target: "wss://wintertodt-websocket-xwgrm.ondigitalocean.app/websocket"
  phases:
    - duration: 60
      arrivalCount: 10

scenarios:
  - engine: ws
    name: Echo a string
    flow:
      - connect: "{{target}}?rsn={{$randomString()}}&world={{ $randomNumber(0,2) }}"
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6
      - send: "{{ $randomNumber(1,10000) }}"
      - think: 0.6